onec/configuration/Catalogs/ЛицевыеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЛицевыеСчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВнешнийID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

onec/configuration/Catalogs/Начисления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Начисления</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВнешнийID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКопеек</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

onec/configuration/Catalogs/Платежи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Платежи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВнешнийID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПлатежа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКопеек</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

onec/configuration/CommonModules/DemoFixtures/Ext/Module.bsl
// Загрузка тестовых данных доступна только пользователю с правами записи.
// Привилегированный режим не используется; HTTP API этот метод не публикует.
Процедура ЗагрузитьИПроверить(ПутьФикстур, ПутьОтчета) Экспорт
    Попытка
        Чтение = Новый ЧтениеJSON;
        Чтение.ОткрытьФайл(ПутьФикстур);
        Данные = ПрочитатьJSON(Чтение);
        Чтение.Закрыть();
        НачатьТранзакцию();
        Попытка
            Для Каждого Строка Из Данные.accounts Цикл
                Объект = НайтиИлиСоздать(Справочники.ЛицевыеСчета, Строка.id);
                Объект.НомерСчета = Строка.account_number;
                Объект.Записать();
            КонецЦикла;
            Для Каждого Строка Из Данные.charges Цикл
                Объект = НайтиИлиСоздать(Справочники.Начисления, Строка.id);
                Объект.ЛицевойСчет = Справочники.ЛицевыеСчета.НайтиПоРеквизиту("ВнешнийID", Строка.account_id);
                Объект.Период = Строка.period;
                Объект.СуммаКопеек = Строка.amount_kopecks;
                Объект.Записать();
            КонецЦикла;
            Для Каждого Строка Из Данные.payments Цикл
                Объект = НайтиИлиСоздать(Справочники.Платежи, Строка.id);
                Объект.ЛицевойСчет = Справочники.ЛицевыеСчета.НайтиПоРеквизиту("ВнешнийID", Строка.account_id);
                Объект.ДатаПлатежа = Дата(СтрЗаменить(Строка.date, "-", "") + "000000");
                Объект.СуммаКопеек = Строка.amount_kopecks;
                Объект.Записать();
            КонецЦикла;
            ЗафиксироватьТранзакцию();
        Исключение
            ОтменитьТранзакцию();
            ВызватьИсключение;
        КонецПопытки;
        Результат = Новый Структура("status,snapshot", "PASS", СнимокДанных());
    Исключение
        Результат = Новый Структура("status,reason", "BLOCKED", ОписаниеОшибки());
    КонецПопытки;
    Запись = Новый ЗаписьJSON;
    Запись.ОткрытьФайл(ПутьОтчета);
    ЗаписатьJSON(Запись, Результат);
    Запись.Закрыть();
КонецПроцедуры

Функция НайтиИлиСоздать(Менеджер, ВнешнийID)
    Ссылка = Менеджер.НайтиПоРеквизиту("ВнешнийID", ВнешнийID);
    Если Ссылка.Пустая() Тогда
        Объект = Менеджер.СоздатьЭлемент();
        Объект.ВнешнийID = ВнешнийID;
        Объект.Наименование = ВнешнийID;
    Иначе
        Объект = Ссылка.ПолучитьОбъект();
    КонецЕсли;
    Возврат Объект;
КонецФункции

// Только для новой учебной базы. Пароли учебной платформой не поддерживаются.
// Вызывается локально администратором, не публикуется через HTTP.
Процедура ПодготовитьДоступ(ПутьОтчета) Экспорт
    Попытка
        Если ПользователиИнформационнойБазы.ПолучитьПользователей().Количество() <> 0 Тогда
            ВызватьИсключение "Настройка доступа разрешена только в новой базе без пользователей";
        КонецЕсли;
        Администратор = ПользователиИнформационнойБазы.СоздатьПользователя();
        Администратор.Имя = "DemoAdmin";
        Администратор.АутентификацияСтандартная = Истина;
        Администратор.Роли.Добавить(Метаданные.Роли.FullAccess);
        Администратор.Записать();
        Читатель = ПользователиИнформационнойБазы.СоздатьПользователя();
        Читатель.Имя = "APIReader";
        Читатель.АутентификацияСтандартная = Истина;
        Читатель.Роли.Добавить(Метаданные.Роли.APIReadOnly);
        Читатель.Записать();
        Результат = Новый Структура("status,reader,passwords", "PASS", "APIReader", "unsupported-training-edition");
    Исключение
        Результат = Новый Структура("status,reason", "BLOCKED", ОписаниеОшибки());
    КонецПопытки;
    СохранитьОтчет(ПутьОтчета, Результат);
КонецПроцедуры

Процедура ПроверитьТолькоЧтение(ПутьОтчета) Экспорт
    Попытка
        Если Не РольДоступна("APIReadOnly") Или РольДоступна("FullAccess") Тогда
            ВызватьИсключение "Ожидается пользователь только с ролью APIReadOnly";
        КонецЕсли;
        Снимок = СнимокДанных();
        Проверки = Новый Массив;
        Проверки.Добавить(ПроверитьЗапретЗаписи(Справочники.ЛицевыеСчета, "acc-alice"));
        Проверки.Добавить(ПроверитьЗапретЗаписи(Справочники.Начисления, "charge-1"));
        Проверки.Добавить(ПроверитьЗапретЗаписи(Справочники.Платежи, "payment-1"));
        Результат = Новый Структура("status,snapshot,write_checks", "PASS", Снимок, Проверки);
        Для Каждого Проверка Из Проверки Цикл
            Если Не Проверка.denied Тогда
                Результат.status = "BLOCKED";
            КонецЕсли;
        КонецЦикла;
    Исключение
        Результат = Новый Структура("status,reason", "BLOCKED", ОписаниеОшибки());
    КонецПопытки;
    СохранитьОтчет(ПутьОтчета, Результат);
КонецПроцедуры

Функция ПроверитьЗапретЗаписи(Менеджер, ВнешнийID)
    Объект = Менеджер.НайтиПоРеквизиту("ВнешнийID", ВнешнийID).ПолучитьОбъект();
    Результат = Новый Структура("id,denied,error", ВнешнийID, Ложь, "");
    НачатьТранзакцию();
    Попытка
        Объект.Записать();
    Исключение
        Результат.error = ОписаниеОшибки();
        Результат.denied = СтрНайти(НРег(Результат.error), "прав") > 0;
    КонецПопытки;
    // Даже при ошибочно выданных правах тест ничего не фиксирует.
    ОтменитьТранзакцию();
    Возврат Результат;
КонецФункции

Процедура СохранитьОтчет(ПутьОтчета, Результат)
    Запись = Новый ЗаписьJSON;
    Запись.ОткрытьФайл(ПутьОтчета);
    ЗаписатьJSON(Запись, Результат);
    Запись.Закрыть();
КонецПроцедуры

Функция СнимокДанных()
    Счета = Новый Массив;
    Выборка = Справочники.ЛицевыеСчета.Выбрать();
    Пока Выборка.Следующий() Цикл
        Счета.Добавить(Новый Структура("id,account_number", Выборка.ВнешнийID, Выборка.НомерСчета));
    КонецЦикла;
    Начисления = Новый Массив;
    Выборка = Справочники.Начисления.Выбрать();
    Пока Выборка.Следующий() Цикл
        Начисления.Добавить(Новый Структура("id,account_id,period,amount_kopecks",
            Выборка.ВнешнийID, Выборка.ЛицевойСчет.ВнешнийID, Выборка.Период, Выборка.СуммаКопеек));
    КонецЦикла;
    Платежи = Новый Массив;
    Выборка = Справочники.Платежи.Выбрать();
    Пока Выборка.Следующий() Цикл
        Платежи.Добавить(Новый Структура("id,account_id,date,amount_kopecks",
            Выборка.ВнешнийID, Выборка.ЛицевойСчет.ВнешнийID,
            Формат(Выборка.ДатаПлатежа, "ДФ=yyyy-MM-dd"), Выборка.СуммаКопеек));
    КонецЦикла;
    Возврат Новый Структура("accounts,charges,payments", Счета, Начисления, Платежи);
КонецФункции
